projects/11_boat_hull_fixed/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0.3 0 0);
    }

    outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    atmosphere
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    bottom
    {
        type            noSlip;
    }

    port
    {
        type            symmetryPlane;
    }

    starboard
    {
        type            symmetryPlane;
    }

    boat
    {
        type            noSlip;
    }
}
