projects/11_boat_hull_fixed/0/p_rgh
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    outlet
    {
        type            totalPressure;
        p0              uniform 0;
        value           uniform 0;
    }

    atmosphere
    {
        type            totalPressure;
        p0              uniform 0;
        value           uniform 0;
    }

    bottom
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    port
    {
        type            symmetryPlane;
    }

    starboard
    {
        type            symmetryPlane;
    }

    boat
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
}
