projects/11_boat_hull_fixed/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}

convertToMeters 1;

// Domain sizing rationale:
//   Boat length L ≈ 0.155 m, width W ≈ 0.082 m, height H ≈ 0.054 m
//   Upstream:   ~3L = 0.5 m    →  xMin = -0.5
//   Downstream: ~6L = 1.0 m    →  xMax =  1.0
//   Lateral:    ~3W each side   →  yMin = -0.25, yMax = 0.25
//   Below:      ~3H             →  zMin = -0.15
//   Above:      ~3H             →  zMax =  0.15
//   Water level at z = 0

vertices
(
    (-0.5  -0.25  -0.15)   // 0
    ( 1.0  -0.25  -0.15)   // 1
    ( 1.0   0.25  -0.15)   // 2
    (-0.5   0.25  -0.15)   // 3
    (-0.5  -0.25   0.15)   // 4
    ( 1.0  -0.25   0.15)   // 5
    ( 1.0   0.25   0.15)   // 6
    (-0.5   0.25   0.15)   // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (60 20 12) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }

    bottom
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }

    atmosphere
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }

    port
    {
        type symmetryPlane;
        faces
        (
            (0 1 5 4)
        );
    }

    starboard
    {
        type symmetryPlane;
        faces
        (
            (3 7 6 2)
        );
    }
);

mergePatchPairs
(
);
