projects/11_boat_hull_fixed/system/setFieldsDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}

defaultFieldValues
(
    volScalarFieldValue alpha.water 0
);

regions
(
    boxToCell
    {
        box (-10 -10 -10) (10 10 0);
        fieldValues
        (
            volScalarFieldValue alpha.water 1
        );
    }
);
